app/controllers/client_events_controller.rb

SELECT * FROM `events` WHERE (`events`.`id` = 2)
SELECT * FROM `clients`
---
  def new
    @client_event = ClientEvent.new
    @event = Event.find(params[:id])
    @clients = Client.all

SELECT * FROM `events` WHERE (`events`.`id` = 2)
---
  def create
      event = Event.find(params[:event][:id])