app/controllers/client_programs_controller.rb

  def new
    @client_program = ClientProgram.new
    @program = Program.find(params[:id])
    @clients = Client.all
---
SELECT * FROM `programs` WHERE (`programs`.`id` = 5)
SELECT * FROM `clients`

  def create
     program = Program.find(params[:program][:id])
---
SELECT * FROM `programs` WHERE (`programs`.`id` = 5)