app/controllers/volunteer_events_controller.rb

SELECT * FROM `events` WHERE (`events`.`id` = 1)
SELECT * FROM `volunteers`
---
  def new
    @volunteer_event = VolunteerEvent.new
    @event = Event.find(params[:id])
    @volunteers = Volunteer.all

SELECT * FROM `events` WHERE (`events`.`id` = 0)
---
  def create
    event = Event.find(params[:event][:id])