app/controllers/volunteer_programs_controller.rb

  def index
    @volunteer_programs = VolunteerProgram.all
---
SELECT * FROM `volunteer_programs`

  def new
    @volunteer_program = VolunteerProgram.new
     @program = Program.find(params[:id])
     @volunteers = Volunteer.all
---
SELECT * FROM `programs` WHERE (`programs`.`id` = 5)
SELECT * FROM `volunteers`

  def create
     program = Program.find(params[:program][:id])
---
SELECT * FROM `programs` WHERE (`programs`.`id` = 5)